Revit 2026 API

# RebarCreateFreeForm(Document, RebarBarType, Element, IListIListCurve, RebarStyle) Method

---
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static RebarFreeFormCreationResult CreateFreeForm(
	Document doc,
	RebarBarType barType,
	Element host,
	IList<IList<Curve>> curves,
	RebarStyle style
)
```
```vb
Public Shared Function CreateFreeForm (
	doc As Document,
	barType As RebarBarType,
	host As Element,
	curves As IList(Of IList(Of Curve)),
	style As RebarStyle
) As RebarFreeFormCreationResult
```
```cpp
public:
static RebarFreeFormCreationResult^ CreateFreeForm(
	Document^ doc,
	RebarBarType^ barType,
	Element^ host,
	IList<IList<Curve^>^>^ curves,
	RebarStyle style
)
```
```fsharp
static member CreateFreeForm :
        doc : Document *
        barType : RebarBarType *
        host : Element *
        curves : IList<IList<Curve>> *
        style : RebarStyle -> RebarFreeFormCreationResult
```

#### Parameters

doc Document

barType RebarBarType

host Element

curves IListIListCurve

style RebarStyle

#### Return Value

RebarFreeFormCreationResult

#### Reference

Rebar Class

CreateFreeForm Overload

Autodesk.Revit.DB.Structure Namespace